{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__dtype__": "0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_1", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "64", 
        "pad": "(1,1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_2", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2,2)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_1", 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "128", 
        "pad": "(1,1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_2", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(2,2)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_1", 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_2", 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "256", 
        "pad": "(1,1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_3", 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "kernel": "(2,2)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4_1", 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4_2", 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4_3", 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attrs": {
        "kernel": "(2,2)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn5_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn5_1", 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn5_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn5_2", 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attrs": {
        "kernel": "(3,3)", 
        "no_bias": "false", 
        "num_filter": "512", 
        "pad": "(1,1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn5_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn5_3", 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attrs": {
        "kernel": "(2,2)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc6_weight", 
      "attrs": {
        "flatten": "true", 
        "no_bias": "false", 
        "num_hidden": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc6_bias", 
      "attrs": {
        "flatten": "true", 
        "no_bias": "false", 
        "num_hidden": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc6", 
      "attrs": {
        "flatten": "true", 
        "no_bias": "false", 
        "num_hidden": "512"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop6", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc8_weight", 
      "attrs": {
        "no_bias": "false", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc8_bias", 
      "attrs": {
        "no_bias": "false", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc8", 
      "attrs": {
        "no_bias": "false", 
        "num_hidden": "10"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    39, 
    40, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    67, 
    68, 
    70, 
    71, 
    72, 
    73, 
    76, 
    77, 
    79, 
    80, 
    81, 
    82, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    95, 
    96, 
    98, 
    99, 
    100, 
    101, 
    104, 
    105, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    116, 
    117, 
    118, 
    119, 
    123, 
    124, 
    128, 
    129, 
    131
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160
  ], 
  "heads": [[132, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}