{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(100, 100)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(100, 100)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(100, 100)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "workspace": "1024"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc6_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc6_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fc6", 
      "attrs": {
        "kernel": "(7, 7)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop6", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc7_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc7_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fc7", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "4096", 
        "workspace": "1024"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop7", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "score_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "score_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "score", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "score2_weight", 
      "attrs": {
        "adj": "(1, 1)", 
        "kernel": "(4, 4)", 
        "num_filter": "21", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "score2", 
      "attrs": {
        "adj": "(1, 1)", 
        "kernel": "(4, 4)", 
        "num_filter": "21", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "score_pool4_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "score_pool4_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "score_pool4", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": [[44, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Crop", 
      "name": "score_pool4c", 
      "attrs": {
        "num_args": "2", 
        "offset": "(5, 5)"
      }, 
      "inputs": [[75, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[72, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "score4_weight", 
      "attrs": {
        "adj": "(1, 1)", 
        "kernel": "(4, 4)", 
        "num_filter": "21", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "score4", 
      "attrs": {
        "adj": "(1, 1)", 
        "kernel": "(4, 4)", 
        "num_filter": "21", 
        "stride": "(2, 2)", 
        "workspace": "1024"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "score_pool3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "score_pool3_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "score_pool3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "21", 
        "workspace": "1024"
      }, 
      "inputs": [[31, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Crop", 
      "name": "score_pool3c", 
      "attrs": {
        "num_args": "2", 
        "offset": "(9, 9)"
      }, 
      "inputs": [[82, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[79, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bigscore_weight", 
      "attrs": {
        "adj": "(7, 7)", 
        "kernel": "(16, 16)", 
        "num_filter": "21", 
        "stride": "(8, 8)", 
        "workspace": "1024"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "bigscore", 
      "attrs": {
        "adj": "(7, 7)", 
        "kernel": "(16, 16)", 
        "num_filter": "21", 
        "stride": "(8, 8)", 
        "workspace": "1024"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Crop", 
      "name": "upscore", 
      "attrs": {
        "num_args": "2", 
        "offset": "(31, 31)"
      }, 
      "inputs": [[86, 0, 0], [0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attrs": {
        "ignore_label": "255", 
        "multi_output": "True", 
        "use_ignore": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "attrs": {
        "ignore_label": "255", 
        "multi_output": "True", 
        "use_ignore": "True"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    10, 
    11, 
    14, 
    15, 
    19, 
    20, 
    23, 
    24, 
    27, 
    28, 
    32, 
    33, 
    36, 
    37, 
    40, 
    41, 
    45, 
    46, 
    49, 
    50, 
    53, 
    54, 
    58, 
    59, 
    63, 
    64, 
    68, 
    69, 
    71, 
    73, 
    74, 
    78, 
    80, 
    81, 
    85, 
    88
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    64, 
    65, 
    66, 
    67, 
    68, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92
  ], 
  "heads": [[89, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}