{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "100"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4, 5], 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], 
  "heads": [[6, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}