{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__profiler_scope__": "<unk>:"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_bias", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__profiler_scope__": "<unk>:"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__profiler_scope__": "<unk>:"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_bias", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__profiler_scope__": "<unk>:"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4, 5], 
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7], 
  "heads": [[6, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 20000]}
}